const numbers = [1, 2, 3, 4, 5]
const result = numbers.forEach(num => console.log(num))
console.log(result);
//^ map(): এটি একটি অ্যারের প্রতিটি উপাদানের ওপর কাজ করে এবং ফলাফল হিসেবে একটি নতুন অ্যারে রিটার্ন করে। এটি মূল অ্যারে-তে কোনো পরিবর্তন করে না।

//^ forEach(): এটি একটি অ্যারের প্রতিটি উপাদানের ওপর শুধুমাত্র একটি ফাংশন চালায় (যেমন: console.log করা)। এটি কোনো কিছু রিটার্ন করে না (ফলাফল undefined আসে)।

//& চেইনিং (Method Chaining) = map যেহেতু একটি নতুন অ্যারে রিটার্ন করে, তাই এর পরে আপনি অন্য মেথড (যেমন: filter বা sort) চেইন করতে পারেন। কিন্তু forEach এর পরে অন্য কোনো মেথড ব্যবহার করা যায় না।